{
  "section1": {
    "btn": { "en": "Cambiar a español", "es": "Change to english" },
    "superTitle": "Valentino Guerra",
    "superSubtitle": {
      "en": "Web Frontend Developer",
      "es": "Desarrollador Web de Frontend"
    },
    "cardTitle": {
      "en": "Hello!",
      "es": "Hola!"
    },
    "ph1": {
      "en": [
        "I am a software developer from",
        "Mar del Plata, Argentina",
        ", who loves to",
        "explore",
        "and",
        "create",
        "new things."
      ],
      "es": [
        "Soy un desarrollador de sofware de",
        "Mar del Plata, Argentina",
        ", que le encanta",
        "explorar",
        "y",
        "crear",
        "cosas nuevas."
      ]
    },
    "ph2": {
      "en": "To make something awesome, make it simple",
      "es": "Si quieres hacer algo asmobroso, hazlo simple."
    },
    "btn1": {
      "en": "About me",
      "es": "Sobre mí"
    },
    "btn2": {
      "en": "Skills",
      "es": "Habilidades"
    },
    "btn3": {
      "en": "Projects",
      "es": "Proyectos"
    },
    "btn4": {
      "en": "Contact me!",
      "es": "Contáctame!"
    }
  },
  "section2": {
    "title": {
      "en": "About me",
      "es": "Sobre mí"
    },
    "ph1": {
      "en": "I am 21 years old.",
      "es": "Tengo 21 años."
    },
    "ph2": {
      "en": "I like to explore, travel, meet new people and places in nature.",
      "es": "Me gusta explorar, ir de viaje, conocer gente y lugares nuevos en la naturaleza."
    },
    "ph3": {
      "en": "Since I was a kid I like to create things, either to solve a problem or just for fun.",
      "es": "Desde pequeño me gusta crear cosas, ya sea para solucionar algún problema o simplemente por diversión."
    },
    "ph4": {
      "en": "I started programming about 5 years ago with the idea of creating mobile apps and games, but then I decided to go into web development.",
      "es": "Empecé a programar hace unos 5 años con la idea de crear apps móviles y juegos, pero luego me decidí por el desarrollo web."
    },
    "expandable1": {
      "title": { "en": "My studies", "es": "Mis estudios" },
      "ph1": {
        "en": "I did not study at the university.",
        "es": "No estudié en la universidad."
      },
      "ph2": {
        "en": [
          "All my knowledge comes from my \"self-taught\" studies and the experience acquired in my projects.",
          "Why did I drop out of college? (spanish)"
        ],
        "es": [
          "Todos mis conocimientos vienen de mis estudios de \"autodidacta\" y la experiencia adquirida en mis proyectos.",
          "¿Por qué dejé la universidad?"
        ]
      },
      "ph3": {
        "en": "From time to time, I like to put together a study plan based on the things that I feel like learning and think will be most useful to me. Then I dedicate a couple of hours each day until I complete it.",
        "es": "Cada cierto tiempo, me gusta armar un plan de estudio basándome en las cosas que tengo ganas de aprender y creo que me serán mas útiles. Y luego dedicarle un par de horas cada día hasta completarlo."
      }
    },
    "expandable2": {
      "title": { "en": "My daily life", "es": "Mi día a día" },
      "ph1": {
        "en": "I consider it extremely important to maintain a balanced life, which implies:",
        "es": "Considero sumamente importante mantener una vida balanceada, lo cual implica:"
      },
      "list": [
        {
          "en": "Not to exceed my working hours.",
          "es": "No exceder mis horas de trabajo."
        },
        {
          "en": "Doing sports several times a week.",
          "es": "Hacer deporte varias veces por semana."
        },
        {
          "en": "Every so often while using the computer, go for a walk to clear my mind.",
          "es": "Cada cierto tiempo usando la computadora, salir a caminar para despejar la mente."
        },
        {
          "en": "Leave some time to disconnect from everything and enjoy life.",
          "es": "Dejar tiempo para desconectar de todo y disfrutar de la vida."
        },
        {
          "en": "Have a good sleep, 8 hours a day.",
          "es": "Dormir bien, 8 horas por día."
        }
      ]
    },
    "expandable3": {
      "title": { "en": "My notes", "es": "Mis notas" },
      "ph1": {
        "en": "When I learn something new, I like to write it down so I don't forget it. Explained in my own words so that, at least for me, it is easier to understand.",
        "es": "Cuando aprendo algo nuevo, me gusta anotarlo para no olvidarlo. Explicado con mis propias palabras de forma que, al menos para mí, me sea más fácil de entender."
      },
      "ph2": {
        "en": [
          "Someone might find it useful, so here it is:",
          "A place where I write things..."
        ],
        "es": [
          "A alguien podría servirle asi que acá lo dejo:",
          "Un lugar donde escribo cosas... (mostly spanish)"
        ]
      }
    }
  },
  "section3": {
    "title": { "en": "Skills", "es": "Habilidades" },
    "subtitle1": { "en": "I am confident with", "es": "Manejo con confianza" },
    "subtitle2": {
      "en": "I have used in past projects",
      "es": "He utilizado en proyectos pasados"
    },
    "subtitle3": {
      "en": "I want to learn/deepen in the near future.",
      "es": "Quiero aprender/profundizar en un futuro próximo"
    }
  },
  "section4": {
    "title": { "en": "Projects", "es": "Proyectos" },
    "list": [
      {
        "title": { "en": "Mobile games", "es": "Juegos para celular" },
        "ph1": {
          "en": "In my early days with programming, back in 2017, while still in high school, I had a fascination with mobile apps. My goal was to become a millionaire by making a successful app or game, but it was undeniable that I also really enjoyed the process of creating something new. Bringing something that previously only existed in my brain into existence and available to everyone was the best part.",
          "es": "En mis inicios con la programación, allá por el 2017, mientras aún iba a la escuela secundaria, tenía una fascinación por las aplicaciones móviles. Mi objetivo era volverme millonario haciendo un aplicación o un juego exitoso, pero era innegable que también disfrutaba mucho del proceso de crear algo nuevo. Poner en existencia y al alcance de todos, algo que previamente solo existía en mi cerebro, era la mejor parte."
        },
        "ph2": {
          "en": "For a couple of years, I dedicated myself mainly to developing applications, many of them games. I consider that creating games is the most fun way to learn to program. It involves design, planning, problem solving and teamwork. Fundamental skills to develop anything.",
          "es": "Durante un par de años, me dedique principalmente a desarrollar aplicaciones, muchas de ellas juegos. Considero que crear juegos es la manera más divertida de aprender a programar. Ya que involucra diseño, planeación, resolución de problemas y trabajo en equipo. Habilidades fundamentales para desarrollar cualquier cosa."
        }
      },
      {
        "title": {
          "en": "Enigmath: Can you solve them all?",
          "es": "Enigmath: ¿Puedes resolverlos todos?"
        },
        "ph1": {
          "en": [
            "My stage of game creation concludes with Enigmath. A game that I developed together with my partner",
            "Iñaki Miranda",
            ", with whom I developed many of the following projects."
          ],
          "es": [
            "Mi etapa de creación de juegos concluye con Enigmath. Un juego que desarrollé junto con mi compañero",
            "Iñaki Miranda",
            ", con quien desarrollé muchos de los siguientes proyectos."
          ]
        },
        "ph2": {
          "en": "After many failed attempts of trying to make overly ambitious games, we realized that we had to start with something simpler, but taking the necessary time for each of the 3 stages of the process. Complete planning, interface design, and programming.",
          "es": "Después de muchos intentos fallidos de intentar hacer juegos demasiado ambiciosos, nos dimos cuenta que había que empezar por algo más simple, pero tomándonos el tiempo necesario para cada una de las 3 etapas del proceso. Planeación completa, diseño de las interfaces, y programación."
        },
        "ph3": {
          "en": [
            "A game of mathematical puzzles in which you must discover the pattern and answer correctly to pass to the next level.",
            "You can download it from Google Play."
          ],
          "es": [
            "Un juego de acertijos matemáticos en el cual debes descubrir el patrón para pasar al siguiente nivel.",
            "Puedes descargarlo desde Google Play"
          ]
        }
      },
      {
        "title": "Socios AOM",
        "ph1": {
          "en": "My latest project in the form of a mobile app. It is a tool for the Association of Dentists of Mar del Plata and all its clients.",
          "es": "Mi último proyecto en forma de app móvil. Es una herramienta para la Asociación de Odontólogos de Mar del Plata y todos sus clientes."
        },
        "ph2": {
          "en": [
            "The final result is of excellent quality, as we focused on making something simple but at the same time being present in all the details and leaving nothing unchecked.",
            "Also available on Google Play",
            "and in the App Store privately."
          ],
          "es": [
            "El resultado final es de una excelente calidad, ya que nos enfocamos en hacer algo simple pero al mismo tiempo estar presentes en todos los detalles y no dejar nada sin revisar.",
            "Tambíen se encuentra en Google Play",
            "y en App Store de forma privada."
          ]
        }
      },
      {
        "title": "Web AOM",
        "ph1": {
          "en": [
            "One of the first websites we developed, also for the Association of Dentists of Mar del Plata.",
            "aom.org.ar"
          ],
          "es": [
            "Una de las primeros sitios web que desarrollamos, también para la Asociación de Odontólogos de Mar del Plata.",
            "aom.org.ar"
          ]
        },
        "ph2": {
          "en": "We made it as a server with Express and Node, it also included an API that connected to MongoDB. Using EJS as a template engine, to add logic to the HTML. It was a big project, from which we learned a lot in both Frontend and Backend. I consider it the previous step to use tools like React.",
          "es": "La hicimos en forma de servidor con Express y Node, también incluía una API que conectaba con MongoDB. Utilizando EJS como motor de plantillas, para agregar lógica al HTML. Fue un proyecto grande, del cual aprendimos mucho tanto en Frontend como Backend. Lo considero el paso previo a utilizar herramientas como React."
        }
      },
      {
        "title": {
          "en": "Students Association",
          "es": "Centro de estudiantes"
        },
        "ph1": {
          "en": "Website for the student center of a local university. It was a small job, but it all adds up to experience.",
          "es": "Sitio web para el centro de estudiantes de una universidad local. Fue un trabajo pequeño, pero todo suma a la experiencia."
        },
        "ph2": {
          "en": "Made with React (create-react-app). While we didn't learn anything new while developing this site, it served to solidify our understanding of React and styling with StyledComponents.",
          "es": "Hecho con React (create-react-app). Si bien no aprendimos nada nuevo al desarrollar este sitio, nos sirvió para solidificar nuestro entendimiento de React y dar estilo con StyledComponents."
        }
      },
      {
        "title": {
          "en": "Photography seller",
          "es": "Venta de fotografías"
        },
        "ph1": {
          "en": "E-commerce type website but very simplified. It is oriented to the sale of photographs, but could be used to sell any other type of products.",
          "es": "Sitio web de tipo e-commerce pero muy simplificado. Esta orientado a la venta de fotografías, pero podría usarse para vender cualquier otro tipo de productos."
        },
        "ph2": {
          "en": [
            "Made with React and Next.js, it helped me to understand in depth the use of server-side rendering offered by Next.js. The website is not currently up and running but you can visit the",
            "Github repositoy",
            "since it's public."
          ],
          "es": [
            "Hecho con React y Next.js, me sirvió para entender a fondo el uso del server-side rendering que ofrece Next.js. El sitio web no está en funcionamiento actualmente pero puedes visitar el",
            "repositorio de GitHub",
            "ya que es público."
          ]
        }
      },
      {
        "title": "Valentino Guerra",
        "ph1": {
          "en": "Yes, the same web page you are on now. No need to show images of it, I just wanted to tell you how I did it.",
          "es": "Si, la misma página web en la que estas ahora. De poco serviría mostrar imágenes, simplemente queria contar como la hice."
        },
        "ph2": {
          "en": "First I did the design in Figma, which took me a few days. I love designing interfaces, but it's an exhausting task even if it doesn't look like it.",
          "es": "Primero hice el diseño en Figma, lo cual me llevo unos días. Me encanta diseñar interfaces, pero es una tarea agotadora aunque no lo parezca."
        },
        "ph3": {
          "en": [
            "Next, it was time to choose which technologies to program it with. I decided not to use Next.js, but not create-react-app either, since I wanted to have the experience of configuring React myself, using Webpack. I also chose Typescript, I hadn't used it in projects for a long time and I wanted to get back to it. Finally I chose TailwindCSS over StyledComponents, simply because I wanted to try something different.",
            "Github repositoy"
          ],
          "es": [
            "Posteriormente, era el momento de elegir con que tecnologías programarla. Me decidí por no utilizar Next.js, pero tampoco create-react-app ya que quería tener la experiencia de configurar React yo mismo, utilizando Webpack. También elegí Typescript, hacía mucho que no lo utilizaba en proyectos y tenía ganas de retomarlo. Por último me quedé con TailwindCSS por sobre StyledComponents, simplemente porque quería probar algo distinto.",
            "Repositorio de GitHub"
          ]
        }
      }
    ]
  },
  "section5": {
    "title": { "en": "Contact Me!", "es": "Contáctame!" },
    "placeholder1": {
      "en": "Name",
      "es": "Nombre"
    },
    "placeholder2": {
      "en": "Email",
      "es": "Correo electrónico"
    },
    "placeholder3": {
      "en": "Message",
      "es": "Mensaje"
    }
  },
  "footer": {
    "en": "by Valentino Guerra, 2022",
    "es": "hecho por Valentino Guerra, 2022"
  }
}
